# HideUnreferencedViewTags Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..HideUnreferencedViewTags Property
PDFExportOptions Class See Also
---
Whether to hide unreferenced view tags.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool HideUnreferencedViewTags { get; set; }
```

Visual Basic
---
```text
Public Property HideUnreferencedViewTags As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HideUnreferencedViewTags {
	bool get ();
	void set (bool value);
}
```

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace